NextFOAM-24/tutorials/lagrangian/reactingParcelFoam/splashPanelFilm/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    sides
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "(film|wallFilm).*"
    {
        type            fixedValue;
        value           $internalField;
    }
}


// ************************************************************************* //
