NextFOAM-24/tutorials/lagrangian/reactingParcelFoam/splashPanelFilm/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runApplication topoSet

runApplication createPatch -overwrite

runApplication makeFaMesh

restore0Dir

#------------------------------------------------------------------------------
